docs/architecture/c4/mermaid/structurizr-ProfileServiceComponent.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Component View: Profile Service"]
    style diagram fill:#ffffff,stroke:#ffffff

    94("<div style='font-weight: bold'>Cloudinary</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Media Management SaaS</div>")
    style 94 fill:#ffffff,stroke:#f29100,color:#f29100

    subgraph 3 ["Task Management"]
      style 3 fill:#ffffff,stroke:#005696,color:#005696

      subgraph 6 ["Profile Service"]
        style 6 fill:#ffffff,stroke:#005696,color:#005696

        10("<div style='font-weight: bold'>Repository</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Repository</div>")
        style 10 fill:#ffffff,stroke:#005696,color:#005696
        11("<div style='font-weight: bold'>Consumer</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Consumer</div>")
        style 11 fill:#ffffff,stroke:#005696,color:#005696
        7("<div style='font-weight: bold'>Security Filter Chain</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Security]</div><div style='font-size: 80%; margin-top:10px'>Security Filter Chain</div>")
        style 7 fill:#ffffff,stroke:#005696,color:#005696
        8("<div style='font-weight: bold'>Controller</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Controller</div>")
        style 8 fill:#ffffff,stroke:#005696,color:#005696
        9("<div style='font-weight: bold'>Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Service</div>")
        style 9 fill:#ffffff,stroke:#005696,color:#005696
      end

      5("<div style='font-weight: bold'>API Gateway</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Cloud Gateway]</div><div style='font-size: 80%; margin-top:10px'>API Gateway</div>")
      style 5 fill:#ffffff,stroke:#005696,color:#005696
      58["<div style='font-weight: bold'>Message Broker</div><div style='font-size: 70%; margin-top: 0px'>[Container: RabbitMQ]</div><div style='font-size: 80%; margin-top:10px'>Message Broker</div>"]
      style 58 fill:#ffffff,stroke:#005696,color:#005696
      59[("<div style='font-weight: bold'>Profile DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: Neo4j]</div><div style='font-size: 80%; margin-top:10px'>Graph DBMS</div>")]
      style 59 fill:#ffffff,stroke:#005696,color:#005696
    end

    9-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[HTTPS/REST]</div>" .->94
    7-. "<div></div><div style='font-size: 70%'></div>" .->8
    8-. "<div></div><div style='font-size: 70%'></div>" .->9
    9-. "<div></div><div style='font-size: 70%'></div>" .->10
    11-. "<div></div><div style='font-size: 70%'></div>" .->9
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->7
    11-. "<div>Subscribe event</div><div style='font-size: 70%'></div>" .->58
    10-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[Bolt]</div>" .->59

  end
